# Используем базовый образ Node.js
FROM node:latest

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json /app

# Устанавливаем зависимости через npm
RUN npm install

# Копируем все файлы из текущей директории в рабочую директорию контейнера
COPY . .

# Указываем порт, на котором будет работать приложение
EXPOSE 8080

# Собираем проект с помощью vite (используем dev сценарий для запуска приложения)
CMD ["npm", "run", "dev"]
